app/controllers/guest_posts_controller.rb

  def index
    @guestpost = GuestPost.new
    @guestposts = GuestPost.order(created_at: :desc)
---
SELECT "guest_posts".* FROM "guest_posts" ORDER BY "guest_posts"."created_at" DESC

  def create
    @guestpost = GuestPost.new(guestpost_params)
    @guestpost.avatar.attach(guestpost_params[:avatar])

    if @guestpost.save
      redirect_to guestbook_path
    else
      @guestposts = GuestPost.all
---
INSERT INTO "guest_posts" ("title", "body", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "ewr"], ["body", "sad"], ["created_at", "2024-09-22 22:20:33.160099"], ["updated_at", "2024-09-22 22:20:33.160099"], ["author", "wef"]]
SELECT "guest_posts".* FROM "guest_posts"