app/controllers/home_controller.rb

SELECT "posts".* FROM "posts"
---
  def feed
    @posts = Post.all

SELECT "projects".* FROM "projects"
---
  def projects
    @projects = Project.all